TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_qspi.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_qspi__include
#define ti_devices_msp_peripherals_hw_qspi__include

/* Filename: hw_qspi.h */
/* Revised: 2025-04-09 13:57:08 */
/* Revision: f4602b816b1643a266cc7aae6be755d35f394359 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* QSPI Registers
******************************************************************************/
#define QSPI_IPSPECIFIC_QSPI_OFS                 ((uint32_t)0x00001200U)
#define QSPI_DMA_TRIG_TX_OFS                     ((uint32_t)0x00001080U)
#define QSPI_DMA_TRIG_RX_OFS                     ((uint32_t)0x00001050U)
#define QSPI_CPU_INT_OFS                         ((uint32_t)0x00001020U)
#define QSPI_GPRCM_OFS                           ((uint32_t)0x00000800U)


/** @addtogroup QSPI_IPSPECIFIC_QSPI
  @{
*/

typedef struct {
  __IO uint32_t QSPICTL0;                          /* !< (@ 0x00001200) QSPI Control-0 register */
  __IO uint32_t QSPICTL1;                          /* !< (@ 0x00001204) QSPI Control-1 Register */
  __IO uint32_t QSPITIMING;                        /* !< (@ 0x00001208) The register is controls the timing setting for
                                                      chip select assertion and de-assertion with respect to the serial
                                                      clock, sampling delay for the data and chip-select behavior in
                                                      performance mode */
  __O  uint32_t QSPIFIFOCTL;                       /* !< (@ 0x0000120C) The register controls the flush operation in the
                                                      peripheral FIFO */
  __IO uint32_t QSPICSCTL;                         /* !< (@ 0x00001210) The register controls the toggling of chip select */
       uint32_t RESERVED0[3];
  __O  uint32_t QSPIDMACTL;                        /* !< (@ 0x00001220) The register is used to generate a soft trigger
                                                      for the DMA */
       uint32_t RESERVED1[4];
  __I  uint32_t QSPISTATUS;                        /* !< (@ 0x00001234) The register contains the status bits for the QSPI
                                                      controller and the FIFO */
} QSPI_IPSPECIFIC_QSPI_Regs;

/*@}*/ /* end of group QSPI_IPSPECIFIC_QSPI */

/** @addtogroup QSPI_DMA_TRIG_TX
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001080) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000010A0) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x000010A8) Interrupt clear */
} QSPI_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group QSPI_DMA_TRIG_TX */

/** @addtogroup QSPI_DMA_TRIG_RX
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001050) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001070) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001078) Interrupt clear */
} QSPI_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group QSPI_DMA_TRIG_RX */

/** @addtogroup QSPI_CPU_INT
  @{
*/

