TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_qspi.h
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} QSPI_CPU_INT_Regs;

/*@}*/ /* end of group QSPI_CPU_INT */

/** @addtogroup QSPI_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00000808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} QSPI_GPRCM_Regs;

/*@}*/ /* end of group QSPI_GPRCM */

/** @addtogroup QSPI
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  QSPI_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[506];
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00001000) Clock Divider */
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00001004) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED2[4];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED3;
  QSPI_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED4;
  QSPI_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00001050) */
       uint32_t RESERVED5;
  QSPI_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00001080) */
       uint32_t RESERVED6[13];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
  __IO uint32_t INTCTL;                            /* !< (@ 0x000010E4) Interrupt control register */
       uint32_t RESERVED7[6];
  __IO uint32_t CTL0;                              /* !< (@ 0x00001100) SPI control register 0 */
  __IO uint32_t CTL1;                              /* !< (@ 0x00001104) SPI control register 1 */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00001108) Clock prescaler and divider register. */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000110C) Interrupt FIFO Level Select Register */
  __I  uint32_t STAT;                              /* !< (@ 0x00001110) Status Register */
       uint32_t RESERVED8[7];
  __I  uint32_t RXDATA;                            /* !< (@ 0x00001130) RXDATA Register */
       uint32_t RESERVED9[3];
  __IO uint32_t TXDATA;                            /* !< (@ 0x00001140) TXDATA Register */
       uint32_t RESERVED10[47];
  QSPI_IPSPECIFIC_QSPI_Regs  IPSPECIFIC_QSPI;                   /* !< (@ 0x00001200) */
} QSPI_Regs;

/*@}*/ /* end of group QSPI */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* QSPI Register Control Bits
******************************************************************************/

/* QSPI_QSPICTL0 Bits */
/* QSPI_QSPICTL0[QSPIDUMMYCLK] Bits */
#define QSPI_QSPICTL0_QSPIDUMMYCLK_OFS           (0)                             /* !< QSPIDUMMYCLK Offset */
#define QSPI_QSPICTL0_QSPIDUMMYCLK_MASK          ((uint32_t)0x0000000FU)         /* !< The bits provides the number of
                                                                                    dummy clocks to insert during a flash
                                                                                    read operation */
#define QSPI_QSPICTL0_QSPIDUMMYCLK_MINIMUM       ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_QSPICTL0_QSPIDUMMYCLK_MAXIMUM       ((uint32_t)0x0000000FU)         /* !< Largest possible value */
/* QSPI_QSPICTL0[QSPIDSIZE] Bits */
#define QSPI_QSPICTL0_QSPIDSIZE_OFS              (6)                             /* !< QSPIDSIZE Offset */
#define QSPI_QSPICTL0_QSPIDSIZE_MASK             ((uint32_t)0x000000C0U)         /* !< The register bits provide the
                                                                                    packing and unpacking option from the
                                                                                    FIFO to the flash interface */
#define QSPI_QSPICTL0_QSPIDSIZE__8BITDSIZE       ((uint32_t)0x00000000U)         /* !< Sets 8-bit data write and read from
                                                                                    FIFO */
#define QSPI_QSPICTL0_QSPIDSIZE__16BITDSIZE      ((uint32_t)0x00000080U)         /* !< Sets 16-bit data write and read
                                                                                    from FIFO */
#define QSPI_QSPICTL0_QSPIDSIZE__32BITDSIZE      ((uint32_t)0x000000C0U)         /* !< Sets 32-bit data write and read
                                                                                    from FIFO */
/* QSPI_QSPICTL0[QSPICMDBYTE] Bits */
#define QSPI_QSPICTL0_QSPICMDBYTE_OFS            (8)                             /* !< QSPICMDBYTE Offset */
#define QSPI_QSPICTL0_QSPICMDBYTE_MASK           ((uint32_t)0x0000FF00U)         /* !< The register bits provide the
                                                                                    instruction opcode to be used during
                                                                                    a flash read */
#define QSPI_QSPICTL0_QSPICMDBYTE_MINIMUM        ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_QSPICTL0_QSPICMDBYTE_MAXIMUM        ((uint32_t)0x0000FF00U)         /* !< Largest value */
/* QSPI_QSPICTL0[QSPIPERFBYTE] Bits */
#define QSPI_QSPICTL0_QSPIPERFBYTE_OFS           (16)                            /* !< QSPIPERFBYTE Offset */
#define QSPI_QSPICTL0_QSPIPERFBYTE_MASK          ((uint32_t)0x00FF0000U)         /* !< The register bits provide the
                                                                                    performance byte to be used during a
                                                                                    flash read */
#define QSPI_QSPICTL0_QSPIPERFBYTE_MINIMUM       ((uint32_t)0x00000000U)         /* !< Samllest value */
#define QSPI_QSPICTL0_QSPIPERFBYTE_MAXIMUM       ((uint32_t)0x00FF0000U)         /* !< Largest value */
/* QSPI_QSPICTL0[QSPIFORMAT] Bits */
#define QSPI_QSPICTL0_QSPIFORMAT_OFS             (24)                            /* !< QSPIFORMAT Offset */
#define QSPI_QSPICTL0_QSPIFORMAT_MASK            ((uint32_t)0x0F000000U)         /* !< The bits provides the bus format to
                                                                                    be used */
#define QSPI_QSPICTL0_QSPIFORMAT_LEGACY_SPI_FULLDUPLEX ((uint32_t)0x00000000U)         /* !< Legacy SPI format full-duplex */
#define QSPI_QSPICTL0_QSPIFORMAT_SPI_HALFDUPLEX  ((uint32_t)0x01000000U)         /* !< SPI format half-duplex when not
                                                                                    sending a data read frame */
#define QSPI_QSPICTL0_QSPIFORMAT_QPI_HALF_DUPLEX ((uint32_t)0x02000000U)         /* !< QPI format half-duplex when not
                                                                                    sending a data read frame */
#define QSPI_QSPICTL0_QSPIFORMAT_SSS_MODE        ((uint32_t)0x08000000U)         /* !< SSS format when sending a data read
                                                                                    frame */
#define QSPI_QSPICTL0_QSPIFORMAT_SSD_MODE        ((uint32_t)0x09000000U)         /* !< SSD format when sending a data read
                                                                                    frame */
#define QSPI_QSPICTL0_QSPIFORMAT_SDD_MODE        ((uint32_t)0x0A000000U)         /* !< SDD format when sending a data read
                                                                                    frame */
#define QSPI_QSPICTL0_QSPIFORMAT_SSQ_MODE        ((uint32_t)0x0B000000U)         /* !< SSQ format when sending a data read
                                                                                    frame */
#define QSPI_QSPICTL0_QSPIFORMAT_SQQ_MODE        ((uint32_t)0x0C000000U)         /* !< SQQ format when sending a data read
                                                                                    frame */
#define QSPI_QSPICTL0_QSPIFORMAT_QQQ_MODE        ((uint32_t)0x0D000000U)         /* !< QQQ format when sending a data read
                                                                                    frame */
/* QSPI_QSPICTL0[QSPIADDRMODE] Bits */
#define QSPI_QSPICTL0_QSPIADDRMODE_OFS           (28)                            /* !< QSPIADDRMODE Offset */
#define QSPI_QSPICTL0_QSPIADDRMODE_MASK          ((uint32_t)0x10000000U)         /* !< The bit field sets the number of
                                                                                    address byte to be used for
                                                                                    communication with QSPI flash during
                                                                                    a data read */
#define QSPI_QSPICTL0_QSPIADDRMODE__3BYTE_ADDR   ((uint32_t)0x00000000U)         /* !< Use 3-byte address */
#define QSPI_QSPICTL0_QSPIADDRMODE__4BYTE_ADDR   ((uint32_t)0x10000000U)         /* !< Use 4-byte address */
/* QSPI_QSPICTL0[QSPIPERFMODE] Bits */
#define QSPI_QSPICTL0_QSPIPERFMODE_OFS           (29)                            /* !< QSPIPERFMODE Offset */
#define QSPI_QSPICTL0_QSPIPERFMODE_MASK          ((uint32_t)0x20000000U)         /* !< This bit enables or disables the
                                                                                    performance mode byte insertion */
#define QSPI_QSPICTL0_QSPIPERFMODE_DISABLE       ((uint32_t)0x00000000U)         /* !< Performance mode is disabled */
#define QSPI_QSPICTL0_QSPIPERFMODE_ENABLE        ((uint32_t)0x20000000U)         /* !< Performance mode is enabled */
/* QSPI_QSPICTL0[QSPIMODE] Bits */
#define QSPI_QSPICTL0_QSPIMODE_OFS               (31)                            /* !< QSPIMODE Offset */
#define QSPI_QSPICTL0_QSPIMODE_MASK              ((uint32_t)0x80000000U)         /* !< This bits selects which port is
                                                                                    used for QSPI memory access */
#define QSPI_QSPICTL0_QSPIMODE_PERIPH_PORT       ((uint32_t)0x00000000U)         /* !< Selects peripheral port for
                                                                                    external flash access */
#define QSPI_QSPICTL0_QSPIMODE_DIRECT_PORT       ((uint32_t)0x80000000U)         /* !< Selects direct port for external
                                                                                    flash access */

/* QSPI_QSPICTL1 Bits */
/* QSPI_QSPICTL1[TXCOUNT] Bits */
#define QSPI_QSPICTL1_TXCOUNT_OFS                (0)                             /* !< TXCOUNT Offset */
#define QSPI_QSPICTL1_TXCOUNT_MASK               ((uint32_t)0x000001FFU)
#define QSPI_QSPICTL1_TXCOUNT_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define QSPI_QSPICTL1_TXCOUNT_MAXIMUM            ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* QSPI_QSPICTL1[QSPIPREFETCH] Bits */
#define QSPI_QSPICTL1_QSPIPREFETCH_OFS           (31)                            /* !< QSPIPREFETCH Offset */
#define QSPI_QSPICTL1_QSPIPREFETCH_MASK          ((uint32_t)0x80000000U)         /* !< Controls prefetch of data when the
                                                                                    read transaction is started */
#define QSPI_QSPICTL1_QSPIPREFETCH_DISABLE       ((uint32_t)0x00000000U)         /* !< Prefetch is disabled */
#define QSPI_QSPICTL1_QSPIPREFETCH_ENABLE        ((uint32_t)0x80000000U)         /* !< Prefetch is enabled */
/* QSPI_QSPICTL1[RXCOUNT] Bits */
#define QSPI_QSPICTL1_RXCOUNT_OFS                (16)                            /* !< RXCOUNT Offset */
#define QSPI_QSPICTL1_RXCOUNT_MASK               ((uint32_t)0x00FF0000U)
#define QSPI_QSPICTL1_RXCOUNT_RXFIFOMON          ((uint32_t)0x00000000U)         /* !< Only RXFIFO full level is
                                                                                    monitored. */
#define QSPI_QSPICTL1_RXCOUNT_MINIMUM            ((uint32_t)0x00010000U)         /* !< Smalles possible value */
#define QSPI_QSPICTL1_RXCOUNT_MAXIMUM            ((uint32_t)0x00FF0000U)         /* !< Highest possible value */

/* QSPI_QSPITIMING Bits */
/* QSPI_QSPITIMING[CSDEASSERTDLY] Bits */
#define QSPI_QSPITIMING_CSDEASSERTDLY_OFS        (0)                             /* !< CSDEASSERTDLY Offset */
#define QSPI_QSPITIMING_CSDEASSERTDLY_MASK       ((uint32_t)0x00000001U)         /* !< When in QSPI mode the bit controls
                                                                                    the number of serial clock edge after
                                                                                    last SCLK to deassert the chip select */
#define QSPI_QSPITIMING_CSDEASSERTDLY__0P5SCLKDELAY ((uint32_t)0x00000000U)         /* !< Chip select is deasserted 0.5
                                                                                    internal SCLK after last edge of the
                                                                                    external SCLK */
#define QSPI_QSPITIMING_CSDEASSERTDLY__1P5SCLKDELAY ((uint32_t)0x00000001U)         /* !< Chip select is deasserted 1.5
                                                                                    internal SCLK after last edge of the
                                                                                    external SCLK */
/* QSPI_QSPITIMING[CSASSERTDLY] Bits */
#define QSPI_QSPITIMING_CSASSERTDLY_OFS          (4)                             /* !< CSASSERTDLY Offset */
#define QSPI_QSPITIMING_CSASSERTDLY_MASK         ((uint32_t)0x00000010U)         /* !< When in QSPI mode the bit controls
                                                                                    the number of serial clock edge after
                                                                                    chip select is asserted to start the
                                                                                    SCLK */
#define QSPI_QSPITIMING_CSASSERTDLY__0P5SCLKDELAY ((uint32_t)0x00000000U)         /* !< SCLK is started 0.5 internal SCLK
                                                                                    after CS is asserted */
#define QSPI_QSPITIMING_CSASSERTDLY__1P5SCLKDELAY ((uint32_t)0x00000010U)         /* !< SCLK is started 1.5 internal SCLK
                                                                                    after CS is asserted */
/* QSPI_QSPITIMING[DATASAMPLDLY] Bits */
#define QSPI_QSPITIMING_DATASAMPLDLY_OFS         (8)                             /* !< DATASAMPLDLY Offset */
#define QSPI_QSPITIMING_DATASAMPLDLY_MASK        ((uint32_t)0x00000100U)         /* !< When in QSPI mode, controls the
                                                                                    sampling of the received data */
#define QSPI_QSPITIMING_DATASAMPLDLY_NODELAY     ((uint32_t)0x00000000U)         /* !< Received data is sampled on the
                                                                                    rising edge of SCLK */
#define QSPI_QSPITIMING_DATASAMPLDLY__1CLKDELAY  ((uint32_t)0x00000100U)         /* !< Received data is delayed by 1 SCLK
                                                                                    before being sampled */
/* QSPI_QSPITIMING[CSHIGHTIME] Bits */
#define QSPI_QSPITIMING_CSHIGHTIME_OFS           (16)                            /* !< CSHIGHTIME Offset */
#define QSPI_QSPITIMING_CSHIGHTIME_MASK          ((uint32_t)0x00FF0000U)         /* !< When in performance mode, the
                                                                                    parameter provides the number of bus
                                                                                    clocks for which the CS shgall be
                                                                                    high when an address change is
                                                                                    detected */
#define QSPI_QSPITIMING_CSHIGHTIME_MINIMUM       ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_QSPITIMING_CSHIGHTIME_MAXIMUM       ((uint32_t)0x00FF0000U)         /* !< Largest value */

/* QSPI_QSPIFIFOCTL Bits */
/* QSPI_QSPIFIFOCTL[RXFIFOFLUSH] Bits */
#define QSPI_QSPIFIFOCTL_RXFIFOFLUSH_OFS         (0)                             /* !< RXFIFOFLUSH Offset */
#define QSPI_QSPIFIFOCTL_RXFIFOFLUSH_MASK        ((uint32_t)0x00000001U)         /* !< The bit is used to reset the RXFIFO
                                                                                    pointers to flush any data from the
                                                                                    preceding transaction. */
#define QSPI_QSPIFIFOCTL_RXFIFOFLUSH_NOEFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define QSPI_QSPIFIFOCTL_RXFIFOFLUSH_CLEAR       ((uint32_t)0x00000001U)         /* !< Resets the RXFIFO and any
                                                                                    corresponding status bit. The field
                                                                                    will be auto-cleared after RXFIFO is
                                                                                    reset */
/* QSPI_QSPIFIFOCTL[TXFIFOFLUSH] Bits */
#define QSPI_QSPIFIFOCTL_TXFIFOFLUSH_OFS         (1)                             /* !< TXFIFOFLUSH Offset */
#define QSPI_QSPIFIFOCTL_TXFIFOFLUSH_MASK        ((uint32_t)0x00000002U)         /* !< The bit is used to reset the TXFIFO
                                                                                    pointers to flush any data from the
                                                                                    preceding transaction. */
#define QSPI_QSPIFIFOCTL_TXFIFOFLUSH_NOEFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define QSPI_QSPIFIFOCTL_TXFIFOFLUSH_CLEAR       ((uint32_t)0x00000002U)         /* !< Resets the TXFIFO and any
                                                                                    corresponding status bit. The field
                                                                                    will be auto-cleared after TXFIFO is
                                                                                    reset */

