TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_qspi.h
/* QSPI_QSPICSCTL Bits */
/* QSPI_QSPICSCTL[CSHOLDCTL] Bits */
#define QSPI_QSPICSCTL_CSHOLDCTL_OFS             (31)                            /* !< CSHOLDCTL Offset */
#define QSPI_QSPICSCTL_CSHOLDCTL_MASK            ((uint32_t)0x80000000U)         /* !< Controls the chip select hold
                                                                                    feature during an active transaction
                                                                                    when QSPIFORMAT is not 0x0 */
#define QSPI_QSPICSCTL_CSHOLDCTL_NOEFFECT        ((uint32_t)0x00000000U)         /* !< No effect */
#define QSPI_QSPICSCTL_CSHOLDCTL_DEASSERT        ((uint32_t)0x80000000U)         /* !< When written as 1, causes the chip
                                                                                    select to be deasserted after the
                                                                                    current bus transaction is completed */

/* QSPI_QSPIDMACTL Bits */
/* QSPI_QSPIDMACTL[DMATRIG] Bits */
#define QSPI_QSPIDMACTL_DMATRIG_OFS              (0)                             /* !< DMATRIG Offset */
#define QSPI_QSPIDMACTL_DMATRIG_MASK             ((uint32_t)0x00000001U)
#define QSPI_QSPIDMACTL_DMATRIG_DMATRIG_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing the bit as 0 has no effect */
#define QSPI_QSPIDMACTL_DMATRIG_DMATRIG_ENABLE   ((uint32_t)0x00000001U)         /* !< Writing this bit as 1 asserts a DMA
                                                                                    request */

/* QSPI_QSPISTATUS Bits */
/* QSPI_QSPISTATUS[RXFIFOE] Bits */
#define QSPI_QSPISTATUS_RXFIFOE_OFS              (0)                             /* !< RXFIFOE Offset */
#define QSPI_QSPISTATUS_RXFIFOE_MASK             ((uint32_t)0x00000001U)         /* !< Receive FIFO status empty status */
#define QSPI_QSPISTATUS_RXFIFOE_RXFIFOE_NE       ((uint32_t)0x00000000U)         /* !< Receive FIFO is not empty */
#define QSPI_QSPISTATUS_RXFIFOE_RXFIFOE_E        ((uint32_t)0x00000001U)         /* !< Receive FIFO is empty */
/* QSPI_QSPISTATUS[RXFIFONF] Bits */
#define QSPI_QSPISTATUS_RXFIFONF_OFS             (1)                             /* !< RXFIFONF Offset */
#define QSPI_QSPISTATUS_RXFIFONF_MASK            ((uint32_t)0x00000002U)         /* !< Receive FIFO not full status */
#define QSPI_QSPISTATUS_RXFIFONF_RXFIFONF_F      ((uint32_t)0x00000000U)         /* !< Receive FIFO is full */
#define QSPI_QSPISTATUS_RXFIFONF_RXFIFONF_NF     ((uint32_t)0x00000002U)         /* !< Receive FIFO is not full */
/* QSPI_QSPISTATUS[TXFIFOE] Bits */
#define QSPI_QSPISTATUS_TXFIFOE_OFS              (2)                             /* !< TXFIFOE Offset */
#define QSPI_QSPISTATUS_TXFIFOE_MASK             ((uint32_t)0x00000004U)         /* !< Transmit FIFO empty status */
#define QSPI_QSPISTATUS_TXFIFOE_TXFIFOE_NE       ((uint32_t)0x00000000U)         /* !< Transmit FIFO is not empty */
#define QSPI_QSPISTATUS_TXFIFOE_TXFIFOE_E        ((uint32_t)0x00000004U)         /* !< Transmit FIFO is empty */
/* QSPI_QSPISTATUS[TXFIFONF] Bits */
#define QSPI_QSPISTATUS_TXFIFONF_OFS             (3)                             /* !< TXFIFONF Offset */
#define QSPI_QSPISTATUS_TXFIFONF_MASK            ((uint32_t)0x00000008U)         /* !< Transmit FIFO not full status */
#define QSPI_QSPISTATUS_TXFIFONF_TXFIFONF_F      ((uint32_t)0x00000000U)         /* !< Transmit FIFO is full */
#define QSPI_QSPISTATUS_TXFIFONF_TXFIFONF_NF     ((uint32_t)0x00000008U)         /* !< Transmit FIFO is not full */
/* QSPI_QSPISTATUS[QSPISTALL] Bits */
#define QSPI_QSPISTATUS_QSPISTALL_OFS            (6)                             /* !< QSPISTALL Offset */
#define QSPI_QSPISTATUS_QSPISTALL_MASK           ((uint32_t)0x00000040U)         /* !< The bit indicates the state of the
                                                                                    QSPI controller during an active
                                                                                    transaction */
#define QSPI_QSPISTATUS_QSPISTALL_QSPISTALL_ACTIVE ((uint32_t)0x00000000U)         /* !< The QSPI is sending or receiving
                                                                                    data bytes from the memory */
#define QSPI_QSPISTATUS_QSPISTALL_QSPISTALL_STALL ((uint32_t)0x00000040U)         /* !< The QSPI is currently stalled on
                                                                                    the TXFIFO empty to have data or
                                                                                    RXFIFO empty to have space to receive
                                                                                    data */
/* QSPI_QSPISTATUS[QSPIIDLE] Bits */
#define QSPI_QSPISTATUS_QSPIIDLE_OFS             (7)                             /* !< QSPIIDLE Offset */
#define QSPI_QSPISTATUS_QSPIIDLE_MASK            ((uint32_t)0x00000080U)         /* !< Provides the state of the QSPI
                                                                                    controller */
#define QSPI_QSPISTATUS_QSPIIDLE_QSPIIDLE_ACT    ((uint32_t)0x00000000U)         /* !< The QSPI has an active transaction
                                                                                    ongoing or stalled and the chip
                                                                                    select is low */
#define QSPI_QSPISTATUS_QSPIIDLE_QSPIIDLE_IDLE   ((uint32_t)0x00000080U)         /* !< The QSPI does not have an active
                                                                                    transaction and the chip select is
                                                                                    high */

/* QSPI_DMA_TRIG_TX_IIDX Bits */
/* QSPI_DMA_TRIG_TX_IIDX[STAT] Bits */
#define QSPI_DMA_TRIG_TX_IIDX_STAT_OFS           (0)                             /* !< STAT Offset */
#define QSPI_DMA_TRIG_TX_IIDX_STAT_MASK          ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define QSPI_DMA_TRIG_TX_IIDX_STAT_NO_INTR       ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define QSPI_DMA_TRIG_TX_IIDX_STAT_TX_EVT        ((uint32_t)0x00000005U)         /* !< Transmit Event/interrupt pending */

/* QSPI_DMA_TRIG_TX_IMASK Bits */
/* QSPI_DMA_TRIG_TX_IMASK[TX] Bits */
#define QSPI_DMA_TRIG_TX_IMASK_TX_OFS            (4)                             /* !< TX Offset */
#define QSPI_DMA_TRIG_TX_IMASK_TX_MASK           ((uint32_t)0x00000010U)         /* !< Transmit FIFO event mask. */
#define QSPI_DMA_TRIG_TX_IMASK_TX_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_DMA_TRIG_TX_IMASK_TX_SET            ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */

