TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_qspi.h
/* QSPI_DMA_TRIG_TX_RIS Bits */
/* QSPI_DMA_TRIG_TX_RIS[TX] Bits */
#define QSPI_DMA_TRIG_TX_RIS_TX_OFS              (4)                             /* !< TX Offset */
#define QSPI_DMA_TRIG_TX_RIS_TX_MASK             ((uint32_t)0x00000010U)         /* !< Transmit FIFO event: A read returns
                                                                                    the current mask for transmit FIFO
                                                                                    interrupt. On a write of 1, the mask
                                                                                    for transmit FIFO interrupt is set
                                                                                    which means the interrupt state will
                                                                                    be reflected in MIS.TXMIS. A write of
                                                                                    0 clears the mask which means
                                                                                    MIS.TXMIS will not reflect the
                                                                                    interrupt. */
#define QSPI_DMA_TRIG_TX_RIS_TX_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_DMA_TRIG_TX_RIS_TX_SET              ((uint32_t)0x00000010U)         /* !< Interrupt occurred */

/* QSPI_DMA_TRIG_TX_MIS Bits */
/* QSPI_DMA_TRIG_TX_MIS[TX] Bits */
#define QSPI_DMA_TRIG_TX_MIS_TX_OFS              (4)                             /* !< TX Offset */
#define QSPI_DMA_TRIG_TX_MIS_TX_MASK             ((uint32_t)0x00000010U)         /* !< Masked Transmit FIFO event */
#define QSPI_DMA_TRIG_TX_MIS_TX_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_DMA_TRIG_TX_MIS_TX_SET              ((uint32_t)0x00000010U)         /* !< Interrupt occurred */

/* QSPI_DMA_TRIG_TX_ISET Bits */
/* QSPI_DMA_TRIG_TX_ISET[TX] Bits */
#define QSPI_DMA_TRIG_TX_ISET_TX_OFS             (4)                             /* !< TX Offset */
#define QSPI_DMA_TRIG_TX_ISET_TX_MASK            ((uint32_t)0x00000010U)         /* !< Set Transmit FIFO event. */
#define QSPI_DMA_TRIG_TX_ISET_TX_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_DMA_TRIG_TX_ISET_TX_SET             ((uint32_t)0x00000010U)         /* !< Set Interrupt */

/* QSPI_DMA_TRIG_TX_ICLR Bits */
/* QSPI_DMA_TRIG_TX_ICLR[TX] Bits */
#define QSPI_DMA_TRIG_TX_ICLR_TX_OFS             (4)                             /* !< TX Offset */
#define QSPI_DMA_TRIG_TX_ICLR_TX_MASK            ((uint32_t)0x00000010U)         /* !< Clear Transmit FIFO event. */
#define QSPI_DMA_TRIG_TX_ICLR_TX_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_DMA_TRIG_TX_ICLR_TX_CLR             ((uint32_t)0x00000010U)         /* !< Clear Interrupt */

/* QSPI_DMA_TRIG_RX_IIDX Bits */
/* QSPI_DMA_TRIG_RX_IIDX[STAT] Bits */
#define QSPI_DMA_TRIG_RX_IIDX_STAT_OFS           (0)                             /* !< STAT Offset */
#define QSPI_DMA_TRIG_RX_IIDX_STAT_MASK          ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define QSPI_DMA_TRIG_RX_IIDX_STAT_NO_INTR       ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define QSPI_DMA_TRIG_RX_IIDX_STAT_RTOUT_EVT     ((uint32_t)0x00000003U)         /* !< SPI receive time-out interrupt */
#define QSPI_DMA_TRIG_RX_IIDX_STAT_RX_EVT        ((uint32_t)0x00000004U)         /* !< Receive Event/interrupt pending */

/* QSPI_DMA_TRIG_RX_IMASK Bits */
/* QSPI_DMA_TRIG_RX_IMASK[RX] Bits */
#define QSPI_DMA_TRIG_RX_IMASK_RX_OFS            (3)                             /* !< RX Offset */
#define QSPI_DMA_TRIG_RX_IMASK_RX_MASK           ((uint32_t)0x00000008U)         /* !< Receive FIFO event mask. */
#define QSPI_DMA_TRIG_RX_IMASK_RX_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_DMA_TRIG_RX_IMASK_RX_SET            ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* QSPI_DMA_TRIG_RX_IMASK[RTOUT] Bits */
#define QSPI_DMA_TRIG_RX_IMASK_RTOUT_OFS         (2)                             /* !< RTOUT Offset */
#define QSPI_DMA_TRIG_RX_IMASK_RTOUT_MASK        ((uint32_t)0x00000004U)         /* !< SPI Receive Time-Out event mask. */
#define QSPI_DMA_TRIG_RX_IMASK_RTOUT_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_DMA_TRIG_RX_IMASK_RTOUT_SET         ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* QSPI_DMA_TRIG_RX_RIS Bits */
/* QSPI_DMA_TRIG_RX_RIS[RX] Bits */
#define QSPI_DMA_TRIG_RX_RIS_RX_OFS              (3)                             /* !< RX Offset */
#define QSPI_DMA_TRIG_RX_RIS_RX_MASK             ((uint32_t)0x00000008U)         /* !< Receive FIFO event.This interrupt
                                                                                    is set if the selected Receive FIFO
                                                                                    level has been reached */
#define QSPI_DMA_TRIG_RX_RIS_RX_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_DMA_TRIG_RX_RIS_RX_SET              ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* QSPI_DMA_TRIG_RX_RIS[RTOUT] Bits */
#define QSPI_DMA_TRIG_RX_RIS_RTOUT_OFS           (2)                             /* !< RTOUT Offset */
#define QSPI_DMA_TRIG_RX_RIS_RTOUT_MASK          ((uint32_t)0x00000004U)         /* !< SPI Receive Time-Out Event. */
#define QSPI_DMA_TRIG_RX_RIS_RTOUT_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_DMA_TRIG_RX_RIS_RTOUT_SET           ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* QSPI_DMA_TRIG_RX_MIS Bits */
/* QSPI_DMA_TRIG_RX_MIS[RX] Bits */
#define QSPI_DMA_TRIG_RX_MIS_RX_OFS              (3)                             /* !< RX Offset */
#define QSPI_DMA_TRIG_RX_MIS_RX_MASK             ((uint32_t)0x00000008U)         /* !< Receive FIFO event mask. */
#define QSPI_DMA_TRIG_RX_MIS_RX_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_DMA_TRIG_RX_MIS_RX_SET              ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* QSPI_DMA_TRIG_RX_MIS[RTOUT] Bits */
#define QSPI_DMA_TRIG_RX_MIS_RTOUT_OFS           (2)                             /* !< RTOUT Offset */
#define QSPI_DMA_TRIG_RX_MIS_RTOUT_MASK          ((uint32_t)0x00000004U)         /* !< SPI Receive Time-Out event mask. */
#define QSPI_DMA_TRIG_RX_MIS_RTOUT_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_DMA_TRIG_RX_MIS_RTOUT_SET           ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

