TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_qspi.h
/* QSPI_DMA_TRIG_RX_ISET Bits */
/* QSPI_DMA_TRIG_RX_ISET[RX] Bits */
#define QSPI_DMA_TRIG_RX_ISET_RX_OFS             (3)                             /* !< RX Offset */
#define QSPI_DMA_TRIG_RX_ISET_RX_MASK            ((uint32_t)0x00000008U)         /* !< Set Receive FIFO event. */
#define QSPI_DMA_TRIG_RX_ISET_RX_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_DMA_TRIG_RX_ISET_RX_SET             ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* QSPI_DMA_TRIG_RX_ISET[RTOUT] Bits */
#define QSPI_DMA_TRIG_RX_ISET_RTOUT_OFS          (2)                             /* !< RTOUT Offset */
#define QSPI_DMA_TRIG_RX_ISET_RTOUT_MASK         ((uint32_t)0x00000004U)         /* !< Set SPI Receive Time-Out event. */
#define QSPI_DMA_TRIG_RX_ISET_RTOUT_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_DMA_TRIG_RX_ISET_RTOUT_SET          ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* QSPI_DMA_TRIG_RX_ICLR Bits */
/* QSPI_DMA_TRIG_RX_ICLR[RX] Bits */
#define QSPI_DMA_TRIG_RX_ICLR_RX_OFS             (3)                             /* !< RX Offset */
#define QSPI_DMA_TRIG_RX_ICLR_RX_MASK            ((uint32_t)0x00000008U)         /* !< Clear Receive FIFO event. */
#define QSPI_DMA_TRIG_RX_ICLR_RX_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_DMA_TRIG_RX_ICLR_RX_CLR             ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* QSPI_DMA_TRIG_RX_ICLR[RTOUT] Bits */
#define QSPI_DMA_TRIG_RX_ICLR_RTOUT_OFS          (2)                             /* !< RTOUT Offset */
#define QSPI_DMA_TRIG_RX_ICLR_RTOUT_MASK         ((uint32_t)0x00000004U)         /* !< Clear SPI Receive Time-Out event. */
#define QSPI_DMA_TRIG_RX_ICLR_RTOUT_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_DMA_TRIG_RX_ICLR_RTOUT_CLR          ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* QSPI_CPU_INT_IIDX Bits */
/* QSPI_CPU_INT_IIDX[STAT] Bits */
#define QSPI_CPU_INT_IIDX_STAT_OFS               (0)                             /* !< STAT Offset */
#define QSPI_CPU_INT_IIDX_STAT_MASK              ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define QSPI_CPU_INT_IIDX_STAT_NO_INTR           ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define QSPI_CPU_INT_IIDX_STAT_RXFIFO_OFV_EVT    ((uint32_t)0x00000001U)         /* !< RX FIFO Overflow Event/interrupt
                                                                                    pending */
#define QSPI_CPU_INT_IIDX_STAT_PER_EVT           ((uint32_t)0x00000002U)         /* !< Transmit Parity Event/interrupt
                                                                                    pending */
#define QSPI_CPU_INT_IIDX_STAT_RTOUT_EVT         ((uint32_t)0x00000003U)         /* !< SPI receive time-out interrupt */
#define QSPI_CPU_INT_IIDX_STAT_RX_EVT            ((uint32_t)0x00000004U)         /* !< Receive Event/interrupt pending */
#define QSPI_CPU_INT_IIDX_STAT_TX_EVT            ((uint32_t)0x00000005U)         /* !< Transmit Event/interrupt pending */
#define QSPI_CPU_INT_IIDX_STAT_TX_EMPTY          ((uint32_t)0x00000006U)         /* !< Transmit Buffer Empty
                                                                                    Event/interrupt pending */
#define QSPI_CPU_INT_IIDX_STAT_IDLE_EVT          ((uint32_t)0x00000007U)         /* !< End of Transmit Event/interrupt
                                                                                    pending */
#define QSPI_CPU_INT_IIDX_STAT_DMA_DONE_RX_EVT   ((uint32_t)0x00000008U)         /* !< DMA Done for Receive
                                                                                    Event/interrupt pending */
#define QSPI_CPU_INT_IIDX_STAT_DMA_DONE_TX_EVT   ((uint32_t)0x00000009U)         /* !< DMA Done for Transmit
                                                                                    Event/interrupt pending */
#define QSPI_CPU_INT_IIDX_STAT_TXFIFO_UNF_EVT    ((uint32_t)0x0000000AU)         /* !< TX FIFO underflow interrupt */
#define QSPI_CPU_INT_IIDX_STAT_RXFULL_EVT        ((uint32_t)0x0000000BU)         /* !< RX FIFO Full Interrupt */

/* QSPI_CPU_INT_IMASK Bits */
/* QSPI_CPU_INT_IMASK[RX] Bits */
#define QSPI_CPU_INT_IMASK_RX_OFS                (3)                             /* !< RX Offset */
#define QSPI_CPU_INT_IMASK_RX_MASK               ((uint32_t)0x00000008U)         /* !< Receive FIFO event.This interrupt
                                                                                    is set if the selected Receive FIFO
                                                                                    level has been reached */
#define QSPI_CPU_INT_IMASK_RX_CLR                ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_RX_SET                ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[TX] Bits */
#define QSPI_CPU_INT_IMASK_TX_OFS                (4)                             /* !< TX Offset */
#define QSPI_CPU_INT_IMASK_TX_MASK               ((uint32_t)0x00000010U)         /* !< Transmit FIFO event mask. */
#define QSPI_CPU_INT_IMASK_TX_CLR                ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_TX_SET                ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[TXEMPTY] Bits */
#define QSPI_CPU_INT_IMASK_TXEMPTY_OFS           (5)                             /* !< TXEMPTY Offset */
#define QSPI_CPU_INT_IMASK_TXEMPTY_MASK          ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty event mask. */
#define QSPI_CPU_INT_IMASK_TXEMPTY_CLR           ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_TXEMPTY_SET           ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[PER] Bits */
#define QSPI_CPU_INT_IMASK_PER_OFS               (1)                             /* !< PER Offset */
#define QSPI_CPU_INT_IMASK_PER_MASK              ((uint32_t)0x00000002U)         /* !< Parity error event mask. */
#define QSPI_CPU_INT_IMASK_PER_CLR               ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_PER_SET               ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define QSPI_CPU_INT_IMASK_DMA_DONE_RX_OFS       (7)                             /* !< DMA_DONE_RX Offset */
#define QSPI_CPU_INT_IMASK_DMA_DONE_RX_MASK      ((uint32_t)0x00000080U)         /* !< DMA Done 1 event for RX event mask. */
#define QSPI_CPU_INT_IMASK_DMA_DONE_RX_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_DMA_DONE_RX_SET       ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[RXFIFO_OVF] Bits */
#define QSPI_CPU_INT_IMASK_RXFIFO_OVF_OFS        (0)                             /* !< RXFIFO_OVF Offset */
#define QSPI_CPU_INT_IMASK_RXFIFO_OVF_MASK       ((uint32_t)0x00000001U)         /* !< RXFIFO overflow event mask. */
#define QSPI_CPU_INT_IMASK_RXFIFO_OVF_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_RXFIFO_OVF_SET        ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define QSPI_CPU_INT_IMASK_DMA_DONE_TX_OFS       (8)                             /* !< DMA_DONE_TX Offset */
#define QSPI_CPU_INT_IMASK_DMA_DONE_TX_MASK      ((uint32_t)0x00000100U)         /* !< DMA Done 1 event for TX event mask. */
#define QSPI_CPU_INT_IMASK_DMA_DONE_TX_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_DMA_DONE_TX_SET       ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[IDLE] Bits */
#define QSPI_CPU_INT_IMASK_IDLE_OFS              (6)                             /* !< IDLE Offset */
#define QSPI_CPU_INT_IMASK_IDLE_MASK             ((uint32_t)0x00000040U)         /* !< SPI Idle event mask. */
#define QSPI_CPU_INT_IMASK_IDLE_CLR              ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_IDLE_SET              ((uint32_t)0x00000040U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[RTOUT] Bits */
#define QSPI_CPU_INT_IMASK_RTOUT_OFS             (2)                             /* !< RTOUT Offset */
#define QSPI_CPU_INT_IMASK_RTOUT_MASK            ((uint32_t)0x00000004U)         /* !< Enable SPI Receive Time-Out event
                                                                                    mask. */
#define QSPI_CPU_INT_IMASK_RTOUT_CLR             ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_RTOUT_SET             ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[RXFULL] Bits */
#define QSPI_CPU_INT_IMASK_RXFULL_OFS            (10)                            /* !< RXFULL Offset */
#define QSPI_CPU_INT_IMASK_RXFULL_MASK           ((uint32_t)0x00000400U)         /* !< RX FIFO Full Interrupt Mask */
#define QSPI_CPU_INT_IMASK_RXFULL_CLR            ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_RXFULL_SET            ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_IMASK[TXFIFO_UNF] Bits */
#define QSPI_CPU_INT_IMASK_TXFIFO_UNF_OFS        (9)                             /* !< TXFIFO_UNF Offset */
#define QSPI_CPU_INT_IMASK_TXFIFO_UNF_MASK       ((uint32_t)0x00000200U)         /* !< TX FIFO underflow interrupt mask */
#define QSPI_CPU_INT_IMASK_TXFIFO_UNF_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_IMASK_TXFIFO_UNF_SET        ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */

/* QSPI_CPU_INT_RIS Bits */
/* QSPI_CPU_INT_RIS[RX] Bits */
#define QSPI_CPU_INT_RIS_RX_OFS                  (3)                             /* !< RX Offset */
#define QSPI_CPU_INT_RIS_RX_MASK                 ((uint32_t)0x00000008U)         /* !< Receive FIFO event.This interrupt
                                                                                    is set if the selected Receive FIFO
                                                                                    level has been reached */
#define QSPI_CPU_INT_RIS_RX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_RX_SET                  ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[TX] Bits */
#define QSPI_CPU_INT_RIS_TX_OFS                  (4)                             /* !< TX Offset */
#define QSPI_CPU_INT_RIS_TX_MASK                 ((uint32_t)0x00000010U)         /* !< Transmit FIFO event..This interrupt
                                                                                    is set if the selected Transmit FIFO
                                                                                    level has been reached. */
#define QSPI_CPU_INT_RIS_TX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_TX_SET                  ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[TXEMPTY] Bits */
#define QSPI_CPU_INT_RIS_TXEMPTY_OFS             (5)                             /* !< TXEMPTY Offset */
#define QSPI_CPU_INT_RIS_TXEMPTY_MASK            ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been move to
                                                                                    the shift register. */
#define QSPI_CPU_INT_RIS_TXEMPTY_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_TXEMPTY_SET             ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[PER] Bits */
#define QSPI_CPU_INT_RIS_PER_OFS                 (1)                             /* !< PER Offset */
#define QSPI_CPU_INT_RIS_PER_MASK                ((uint32_t)0x00000002U)         /* !< Parity error event: this bit is set
                                                                                    if a Parity error has been detected */
#define QSPI_CPU_INT_RIS_PER_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_PER_SET                 ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define QSPI_CPU_INT_RIS_DMA_DONE_RX_OFS         (7)                             /* !< DMA_DONE_RX Offset */
#define QSPI_CPU_INT_RIS_DMA_DONE_RX_MASK        ((uint32_t)0x00000080U)         /* !< DMA Done 1 event for RX. This
                                                                                    interrupt is set if the RX DMA
                                                                                    channel sends the DONE signal. This
                                                                                    allows the handling of the DMA event
                                                                                    inside the mapped peripheral. */
#define QSPI_CPU_INT_RIS_DMA_DONE_RX_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_DMA_DONE_RX_SET         ((uint32_t)0x00000080U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[RXFIFO_OVF] Bits */
#define QSPI_CPU_INT_RIS_RXFIFO_OVF_OFS          (0)                             /* !< RXFIFO_OVF Offset */
#define QSPI_CPU_INT_RIS_RXFIFO_OVF_MASK         ((uint32_t)0x00000001U)         /* !< RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define QSPI_CPU_INT_RIS_RXFIFO_OVF_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_RXFIFO_OVF_SET          ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define QSPI_CPU_INT_RIS_DMA_DONE_TX_OFS         (8)                             /* !< DMA_DONE_TX Offset */
#define QSPI_CPU_INT_RIS_DMA_DONE_TX_MASK        ((uint32_t)0x00000100U)         /* !< DMA Done 1 event for TX. This
                                                                                    interrupt is set if the TX DMA
                                                                                    channel sends the DONE signal. This
                                                                                    allows the handling of the DMA event
                                                                                    inside the mapped peripheral. */
#define QSPI_CPU_INT_RIS_DMA_DONE_TX_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_DMA_DONE_TX_SET         ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[IDLE] Bits */
#define QSPI_CPU_INT_RIS_IDLE_OFS                (6)                             /* !< IDLE Offset */
#define QSPI_CPU_INT_RIS_IDLE_MASK               ((uint32_t)0x00000040U)         /* !< SPI has done finished transfers and
                                                                                    changed into IDLE mode. This bit is
                                                                                    set when BUSY goes low. */
#define QSPI_CPU_INT_RIS_IDLE_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_IDLE_SET                ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[RTOUT] Bits */
#define QSPI_CPU_INT_RIS_RTOUT_OFS               (2)                             /* !< RTOUT Offset */
#define QSPI_CPU_INT_RIS_RTOUT_MASK              ((uint32_t)0x00000004U)         /* !< SPI Receive Time-Out event. */
#define QSPI_CPU_INT_RIS_RTOUT_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_RTOUT_SET               ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[TXFIFO_UNF] Bits */
#define QSPI_CPU_INT_RIS_TXFIFO_UNF_OFS          (9)                             /* !< TXFIFO_UNF Offset */
#define QSPI_CPU_INT_RIS_TXFIFO_UNF_MASK         ((uint32_t)0x00000200U)         /* !< TX FIFO Underflow Interrupt */
#define QSPI_CPU_INT_RIS_TXFIFO_UNF_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_TXFIFO_UNF_SET          ((uint32_t)0x00000200U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_RIS[RXFULL] Bits */
#define QSPI_CPU_INT_RIS_RXFULL_OFS              (10)                            /* !< RXFULL Offset */
#define QSPI_CPU_INT_RIS_RXFULL_MASK             ((uint32_t)0x00000400U)         /* !< RX FIFO Full Interrupt */
#define QSPI_CPU_INT_RIS_RXFULL_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_RIS_RXFULL_SET              ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

/* QSPI_CPU_INT_MIS Bits */
/* QSPI_CPU_INT_MIS[RX] Bits */
#define QSPI_CPU_INT_MIS_RX_OFS                  (3)                             /* !< RX Offset */
#define QSPI_CPU_INT_MIS_RX_MASK                 ((uint32_t)0x00000008U)         /* !< Masked receive FIFO event.This
                                                                                    interrupt is set if the selected
                                                                                    Receive FIFO level has been reached */
#define QSPI_CPU_INT_MIS_RX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_RX_SET                  ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_MIS[TX] Bits */
#define QSPI_CPU_INT_MIS_TX_OFS                  (4)                             /* !< TX Offset */
#define QSPI_CPU_INT_MIS_TX_MASK                 ((uint32_t)0x00000010U)         /* !< Masked Transmit FIFO event. This
                                                                                    interrupt is set if the selected
                                                                                    Transmit FIFO level has been reached. */
#define QSPI_CPU_INT_MIS_TX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_TX_SET                  ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_MIS[TXEMPTY] Bits */
#define QSPI_CPU_INT_MIS_TXEMPTY_OFS             (5)                             /* !< TXEMPTY Offset */
#define QSPI_CPU_INT_MIS_TXEMPTY_MASK            ((uint32_t)0x00000020U)         /* !< Masked Transmit FIFO Empty event. */
#define QSPI_CPU_INT_MIS_TXEMPTY_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_TXEMPTY_SET             ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_MIS[PER] Bits */
#define QSPI_CPU_INT_MIS_PER_OFS                 (1)                             /* !< PER Offset */
#define QSPI_CPU_INT_MIS_PER_MASK                ((uint32_t)0x00000002U)         /* !< Masked Parity error event: this bit
                                                                                    if a Parity error has been detected */
#define QSPI_CPU_INT_MIS_PER_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_PER_SET                 ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_MIS[DMA_DONE_RX] Bits */
#define QSPI_CPU_INT_MIS_DMA_DONE_RX_OFS         (7)                             /* !< DMA_DONE_RX Offset */
#define QSPI_CPU_INT_MIS_DMA_DONE_RX_MASK        ((uint32_t)0x00000080U)         /* !< Masked DMA Done 1 event for RX. */
#define QSPI_CPU_INT_MIS_DMA_DONE_RX_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_DMA_DONE_RX_SET         ((uint32_t)0x00000080U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_MIS[RXFIFO_OVF] Bits */
#define QSPI_CPU_INT_MIS_RXFIFO_OVF_OFS          (0)                             /* !< RXFIFO_OVF Offset */
#define QSPI_CPU_INT_MIS_RXFIFO_OVF_MASK         ((uint32_t)0x00000001U)         /* !< Masked RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define QSPI_CPU_INT_MIS_RXFIFO_OVF_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_RXFIFO_OVF_SET          ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_MIS[DMA_DONE_TX] Bits */
#define QSPI_CPU_INT_MIS_DMA_DONE_TX_OFS         (8)                             /* !< DMA_DONE_TX Offset */
#define QSPI_CPU_INT_MIS_DMA_DONE_TX_MASK        ((uint32_t)0x00000100U)         /* !< Masked DMA Done 1 event for TX. */
#define QSPI_CPU_INT_MIS_DMA_DONE_TX_CLR         ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_DMA_DONE_TX_SET         ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_MIS[IDLE] Bits */
#define QSPI_CPU_INT_MIS_IDLE_OFS                (6)                             /* !< IDLE Offset */
#define QSPI_CPU_INT_MIS_IDLE_MASK               ((uint32_t)0x00000040U)         /* !< Masked SPI IDLE mode event. */
#define QSPI_CPU_INT_MIS_IDLE_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_IDLE_SET                ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_MIS[RTOUT] Bits */
#define QSPI_CPU_INT_MIS_RTOUT_OFS               (2)                             /* !< RTOUT Offset */
#define QSPI_CPU_INT_MIS_RTOUT_MASK              ((uint32_t)0x00000004U)         /* !< Masked SPI Receive Time-Out
                                                                                    Interrupt. */
#define QSPI_CPU_INT_MIS_RTOUT_CLR               ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define QSPI_CPU_INT_MIS_RTOUT_SET               ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_MIS[RXFULL] Bits */
#define QSPI_CPU_INT_MIS_RXFULL_OFS              (10)                            /* !< RXFULL Offset */
#define QSPI_CPU_INT_MIS_RXFULL_MASK             ((uint32_t)0x00000400U)         /* !< RX FIFO Full Interrupt */
#define QSPI_CPU_INT_MIS_RXFULL_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_RXFULL_SET              ((uint32_t)0x00000400U)         /* !< Interrupt occurred */
/* QSPI_CPU_INT_MIS[TXFIFO_UNF] Bits */
#define QSPI_CPU_INT_MIS_TXFIFO_UNF_OFS          (9)                             /* !< TXFIFO_UNF Offset */
#define QSPI_CPU_INT_MIS_TXFIFO_UNF_MASK         ((uint32_t)0x00000200U)         /* !< TX FIFO underflow interrupt */
#define QSPI_CPU_INT_MIS_TXFIFO_UNF_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define QSPI_CPU_INT_MIS_TXFIFO_UNF_SET          ((uint32_t)0x00000200U)         /* !< Interrupt occurred */

