TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_qspi.h
/* QSPI_CPU_INT_ISET Bits */
/* QSPI_CPU_INT_ISET[RX] Bits */
#define QSPI_CPU_INT_ISET_RX_OFS                 (3)                             /* !< RX Offset */
#define QSPI_CPU_INT_ISET_RX_MASK                ((uint32_t)0x00000008U)         /* !< Set Receive FIFO event. */
#define QSPI_CPU_INT_ISET_RX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ISET_RX_SET                 ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* QSPI_CPU_INT_ISET[TX] Bits */
#define QSPI_CPU_INT_ISET_TX_OFS                 (4)                             /* !< TX Offset */
#define QSPI_CPU_INT_ISET_TX_MASK                ((uint32_t)0x00000010U)         /* !< Set Transmit FIFO event. */
#define QSPI_CPU_INT_ISET_TX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ISET_TX_SET                 ((uint32_t)0x00000010U)         /* !< Set Interrupt */
/* QSPI_CPU_INT_ISET[TXEMPTY] Bits */
#define QSPI_CPU_INT_ISET_TXEMPTY_OFS            (5)                             /* !< TXEMPTY Offset */
#define QSPI_CPU_INT_ISET_TXEMPTY_MASK           ((uint32_t)0x00000020U)         /* !< Set Transmit FIFO Empty event. */
#define QSPI_CPU_INT_ISET_TXEMPTY_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ISET_TXEMPTY_SET            ((uint32_t)0x00000020U)         /* !< Set Interrupt */
/* QSPI_CPU_INT_ISET[PER] Bits */
#define QSPI_CPU_INT_ISET_PER_OFS                (1)                             /* !< PER Offset */
#define QSPI_CPU_INT_ISET_PER_MASK               ((uint32_t)0x00000002U)         /* !< Set Parity error event. */
#define QSPI_CPU_INT_ISET_PER_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ISET_PER_SET                ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* QSPI_CPU_INT_ISET[DMA_DONE_RX] Bits */
#define QSPI_CPU_INT_ISET_DMA_DONE_RX_OFS        (7)                             /* !< DMA_DONE_RX Offset */
#define QSPI_CPU_INT_ISET_DMA_DONE_RX_MASK       ((uint32_t)0x00000080U)         /* !< Set DMA Done 1 event for RX. */
#define QSPI_CPU_INT_ISET_DMA_DONE_RX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ISET_DMA_DONE_RX_SET        ((uint32_t)0x00000080U)         /* !< Set Interrupt */
/* QSPI_CPU_INT_ISET[RXFIFO_OVF] Bits */
#define QSPI_CPU_INT_ISET_RXFIFO_OVF_OFS         (0)                             /* !< RXFIFO_OVF Offset */
#define QSPI_CPU_INT_ISET_RXFIFO_OVF_MASK        ((uint32_t)0x00000001U)         /* !< Set RXFIFO overflow event. */
#define QSPI_CPU_INT_ISET_RXFIFO_OVF_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ISET_RXFIFO_OVF_SET         ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* QSPI_CPU_INT_ISET[DMA_DONE_TX] Bits */
#define QSPI_CPU_INT_ISET_DMA_DONE_TX_OFS        (8)                             /* !< DMA_DONE_TX Offset */
#define QSPI_CPU_INT_ISET_DMA_DONE_TX_MASK       ((uint32_t)0x00000100U)         /* !< Set DMA Done 1 event for TX. */
#define QSPI_CPU_INT_ISET_DMA_DONE_TX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ISET_DMA_DONE_TX_SET        ((uint32_t)0x00000100U)         /* !< Set Interrupt */
/* QSPI_CPU_INT_ISET[IDLE] Bits */
#define QSPI_CPU_INT_ISET_IDLE_OFS               (6)                             /* !< IDLE Offset */
#define QSPI_CPU_INT_ISET_IDLE_MASK              ((uint32_t)0x00000040U)         /* !< Set SPI IDLE mode event. */
#define QSPI_CPU_INT_ISET_IDLE_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ISET_IDLE_SET               ((uint32_t)0x00000040U)         /* !< Set Interrupt */
/* QSPI_CPU_INT_ISET[RTOUT] Bits */
#define QSPI_CPU_INT_ISET_RTOUT_OFS              (2)                             /* !< RTOUT Offset */
#define QSPI_CPU_INT_ISET_RTOUT_MASK             ((uint32_t)0x00000004U)         /* !< Set SPI Receive Time-Out Event. */
#define QSPI_CPU_INT_ISET_RTOUT_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ISET_RTOUT_SET              ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_ISET[TXFIFO_UNF] Bits */
#define QSPI_CPU_INT_ISET_TXFIFO_UNF_OFS         (9)                             /* !< TXFIFO_UNF Offset */
#define QSPI_CPU_INT_ISET_TXFIFO_UNF_MASK        ((uint32_t)0x00000200U)         /* !< Set TX FIFO Underflow Event */
#define QSPI_CPU_INT_ISET_TXFIFO_UNF_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define QSPI_CPU_INT_ISET_TXFIFO_UNF_SET         ((uint32_t)0x00000200U)         /* !< Set interrupt */
/* QSPI_CPU_INT_ISET[RXFULL] Bits */
#define QSPI_CPU_INT_ISET_RXFULL_OFS             (10)                            /* !< RXFULL Offset */
#define QSPI_CPU_INT_ISET_RXFULL_MASK            ((uint32_t)0x00000400U)         /* !< Set RX FIFO Full Event */
#define QSPI_CPU_INT_ISET_RXFULL_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define QSPI_CPU_INT_ISET_RXFULL_SET             ((uint32_t)0x00000400U)         /* !< Set Interrupt */

/* QSPI_CPU_INT_ICLR Bits */
/* QSPI_CPU_INT_ICLR[RX] Bits */
#define QSPI_CPU_INT_ICLR_RX_OFS                 (3)                             /* !< RX Offset */
#define QSPI_CPU_INT_ICLR_RX_MASK                ((uint32_t)0x00000008U)         /* !< Clear Receive FIFO event. */
#define QSPI_CPU_INT_ICLR_RX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ICLR_RX_CLR                 ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* QSPI_CPU_INT_ICLR[TX] Bits */
#define QSPI_CPU_INT_ICLR_TX_OFS                 (4)                             /* !< TX Offset */
#define QSPI_CPU_INT_ICLR_TX_MASK                ((uint32_t)0x00000010U)         /* !< Clear Transmit FIFO event. */
#define QSPI_CPU_INT_ICLR_TX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ICLR_TX_CLR                 ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* QSPI_CPU_INT_ICLR[TXEMPTY] Bits */
#define QSPI_CPU_INT_ICLR_TXEMPTY_OFS            (5)                             /* !< TXEMPTY Offset */
#define QSPI_CPU_INT_ICLR_TXEMPTY_MASK           ((uint32_t)0x00000020U)         /* !< Clear Transmit FIFO Empty event. */
#define QSPI_CPU_INT_ICLR_TXEMPTY_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ICLR_TXEMPTY_CLR            ((uint32_t)0x00000020U)         /* !< Clear Interrupt */
/* QSPI_CPU_INT_ICLR[PER] Bits */
#define QSPI_CPU_INT_ICLR_PER_OFS                (1)                             /* !< PER Offset */
#define QSPI_CPU_INT_ICLR_PER_MASK               ((uint32_t)0x00000002U)         /* !< Clear Parity error event. */
#define QSPI_CPU_INT_ICLR_PER_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ICLR_PER_CLR                ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* QSPI_CPU_INT_ICLR[DMA_DONE_RX] Bits */
#define QSPI_CPU_INT_ICLR_DMA_DONE_RX_OFS        (7)                             /* !< DMA_DONE_RX Offset */
#define QSPI_CPU_INT_ICLR_DMA_DONE_RX_MASK       ((uint32_t)0x00000080U)         /* !< Clear DMA Done 1 event for RX. */
#define QSPI_CPU_INT_ICLR_DMA_DONE_RX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ICLR_DMA_DONE_RX_CLR        ((uint32_t)0x00000080U)         /* !< Clear Interrupt */
/* QSPI_CPU_INT_ICLR[RXFIFO_OVF] Bits */
#define QSPI_CPU_INT_ICLR_RXFIFO_OVF_OFS         (0)                             /* !< RXFIFO_OVF Offset */
#define QSPI_CPU_INT_ICLR_RXFIFO_OVF_MASK        ((uint32_t)0x00000001U)         /* !< Clear RXFIFO overflow event. */
#define QSPI_CPU_INT_ICLR_RXFIFO_OVF_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ICLR_RXFIFO_OVF_CLR         ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* QSPI_CPU_INT_ICLR[DMA_DONE_TX] Bits */
#define QSPI_CPU_INT_ICLR_DMA_DONE_TX_OFS        (8)                             /* !< DMA_DONE_TX Offset */
#define QSPI_CPU_INT_ICLR_DMA_DONE_TX_MASK       ((uint32_t)0x00000100U)         /* !< Clear DMA Done 1 event for TX. */
#define QSPI_CPU_INT_ICLR_DMA_DONE_TX_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ICLR_DMA_DONE_TX_CLR        ((uint32_t)0x00000100U)         /* !< Clear Interrupt */
/* QSPI_CPU_INT_ICLR[IDLE] Bits */
#define QSPI_CPU_INT_ICLR_IDLE_OFS               (6)                             /* !< IDLE Offset */
#define QSPI_CPU_INT_ICLR_IDLE_MASK              ((uint32_t)0x00000040U)         /* !< Clear SPI IDLE mode event. */
#define QSPI_CPU_INT_ICLR_IDLE_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ICLR_IDLE_CLR               ((uint32_t)0x00000040U)         /* !< Clear Interrupt */
/* QSPI_CPU_INT_ICLR[RTOUT] Bits */
#define QSPI_CPU_INT_ICLR_RTOUT_OFS              (2)                             /* !< RTOUT Offset */
#define QSPI_CPU_INT_ICLR_RTOUT_MASK             ((uint32_t)0x00000004U)         /* !< Clear SPI Receive Time-Out Event. */
#define QSPI_CPU_INT_ICLR_RTOUT_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_CPU_INT_ICLR_RTOUT_CLR              ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* QSPI_CPU_INT_ICLR[TXFIFO_UNF] Bits */
#define QSPI_CPU_INT_ICLR_TXFIFO_UNF_OFS         (9)                             /* !< TXFIFO_UNF Offset */
#define QSPI_CPU_INT_ICLR_TXFIFO_UNF_MASK        ((uint32_t)0x00000200U)         /* !< Clear TXFIFO underflow event */
#define QSPI_CPU_INT_ICLR_TXFIFO_UNF_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define QSPI_CPU_INT_ICLR_TXFIFO_UNF_CLR         ((uint32_t)0x00000200U)         /* !< Clear interrupt */
/* QSPI_CPU_INT_ICLR[RXFULL] Bits */
#define QSPI_CPU_INT_ICLR_RXFULL_OFS             (10)                            /* !< RXFULL Offset */
#define QSPI_CPU_INT_ICLR_RXFULL_MASK            ((uint32_t)0x00000400U)         /* !< Clear RX FIFO underflow event */
#define QSPI_CPU_INT_ICLR_RXFULL_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define QSPI_CPU_INT_ICLR_RXFULL_CLR             ((uint32_t)0x00000400U)         /* !< Clear interrupt */

/* QSPI_PWREN Bits */
/* QSPI_PWREN[ENABLE] Bits */
#define QSPI_PWREN_ENABLE_OFS                    (0)                             /* !< ENABLE Offset */
#define QSPI_PWREN_ENABLE_MASK                   ((uint32_t)0x00000001U)         /* !< Enable the power */
#define QSPI_PWREN_ENABLE_DISABLE                ((uint32_t)0x00000000U)         /* !< Disable Power */
#define QSPI_PWREN_ENABLE_ENABLE                 ((uint32_t)0x00000001U)         /* !< Enable Power */
/* QSPI_PWREN[KEY] Bits */
#define QSPI_PWREN_KEY_OFS                       (24)                            /* !< KEY Offset */
#define QSPI_PWREN_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define QSPI_PWREN_KEY_UNLOCK_W                  ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* QSPI_RSTCTL Bits */
/* QSPI_RSTCTL[RESETSTKYCLR] Bits */
#define QSPI_RSTCTL_RESETSTKYCLR_OFS             (1)                             /* !< RESETSTKYCLR Offset */
#define QSPI_RSTCTL_RESETSTKYCLR_MASK            ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define QSPI_RSTCTL_RESETSTKYCLR_NOP             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_RSTCTL_RESETSTKYCLR_CLR             ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* QSPI_RSTCTL[RESETASSERT] Bits */
#define QSPI_RSTCTL_RESETASSERT_OFS              (0)                             /* !< RESETASSERT Offset */
#define QSPI_RSTCTL_RESETASSERT_MASK             ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define QSPI_RSTCTL_RESETASSERT_NOP              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define QSPI_RSTCTL_RESETASSERT_ASSERT           ((uint32_t)0x00000001U)         /* !< Assert reset */
/* QSPI_RSTCTL[KEY] Bits */
#define QSPI_RSTCTL_KEY_OFS                      (24)                            /* !< KEY Offset */
#define QSPI_RSTCTL_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define QSPI_RSTCTL_KEY_UNLOCK_W                 ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* QSPI_CLKCFG Bits */
/* QSPI_CLKCFG[KEY] Bits */
#define QSPI_CLKCFG_KEY_OFS                      (24)                            /* !< KEY Offset */
#define QSPI_CLKCFG_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define QSPI_CLKCFG_KEY_UNLOCK                   ((uint32_t)0xA9000000U)         /* !< key value to allow change field of
                                                                                    GPRCM */
/* QSPI_CLKCFG[BLOCKASYNC] Bits */
#define QSPI_CLKCFG_BLOCKASYNC_OFS               (8)                             /* !< BLOCKASYNC Offset */
#define QSPI_CLKCFG_BLOCKASYNC_MASK              ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define QSPI_CLKCFG_BLOCKASYNC_DISABLE           ((uint32_t)0x00000000U)         /* !< Not block async clock request */
#define QSPI_CLKCFG_BLOCKASYNC_ENABLE            ((uint32_t)0x00000100U)         /* !< Block async clock request */

/* QSPI_GPRCM_STAT Bits */
/* QSPI_GPRCM_STAT[RESETSTKY] Bits */
#define QSPI_GPRCM_STAT_RESETSTKY_OFS            (16)                            /* !< RESETSTKY Offset */
#define QSPI_GPRCM_STAT_RESETSTKY_MASK           ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define QSPI_GPRCM_STAT_RESETSTKY_NORES          ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define QSPI_GPRCM_STAT_RESETSTKY_RESET          ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* QSPI_CLKDIV Bits */
/* QSPI_CLKDIV[RATIO] Bits */
#define QSPI_CLKDIV_RATIO_OFS                    (0)                             /* !< RATIO Offset */
#define QSPI_CLKDIV_RATIO_MASK                   ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock */
#define QSPI_CLKDIV_RATIO_DIV_BY_1               ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define QSPI_CLKDIV_RATIO_DIV_BY_2               ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define QSPI_CLKDIV_RATIO_DIV_BY_3               ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define QSPI_CLKDIV_RATIO_DIV_BY_4               ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define QSPI_CLKDIV_RATIO_DIV_BY_5               ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define QSPI_CLKDIV_RATIO_DIV_BY_6               ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define QSPI_CLKDIV_RATIO_DIV_BY_7               ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define QSPI_CLKDIV_RATIO_DIV_BY_8               ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */

/* QSPI_CLKSEL Bits */
/* QSPI_CLKSEL[LFCLK_SEL] Bits */
#define QSPI_CLKSEL_LFCLK_SEL_OFS                (1)                             /* !< LFCLK_SEL Offset */
#define QSPI_CLKSEL_LFCLK_SEL_MASK               ((uint32_t)0x00000002U)         /* !< Selects LFCLK as clock source if
                                                                                    enabled */
#define QSPI_CLKSEL_LFCLK_SEL_DISABLE            ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define QSPI_CLKSEL_LFCLK_SEL_ENABLE             ((uint32_t)0x00000002U)         /* !< Select this clock as a source */
/* QSPI_CLKSEL[MFCLK_SEL] Bits */
#define QSPI_CLKSEL_MFCLK_SEL_OFS                (2)                             /* !< MFCLK_SEL Offset */
#define QSPI_CLKSEL_MFCLK_SEL_MASK               ((uint32_t)0x00000004U)         /* !< Selects MFCLK as clock source if
                                                                                    enabled */
#define QSPI_CLKSEL_MFCLK_SEL_DISABLE            ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define QSPI_CLKSEL_MFCLK_SEL_ENABLE             ((uint32_t)0x00000004U)         /* !< Select this clock as a source */
/* QSPI_CLKSEL[SYSCLK_SEL] Bits */
#define QSPI_CLKSEL_SYSCLK_SEL_OFS               (3)                             /* !< SYSCLK_SEL Offset */
#define QSPI_CLKSEL_SYSCLK_SEL_MASK              ((uint32_t)0x00000008U)         /* !< Selects SYSCLK as clock source if
                                                                                    enabled */
#define QSPI_CLKSEL_SYSCLK_SEL_DISABLE           ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define QSPI_CLKSEL_SYSCLK_SEL_ENABLE            ((uint32_t)0x00000008U)         /* !< Select this clock as a source */

/* QSPI_PDBGCTL Bits */
/* QSPI_PDBGCTL[FREE] Bits */
#define QSPI_PDBGCTL_FREE_OFS                    (0)                             /* !< FREE Offset */
#define QSPI_PDBGCTL_FREE_MASK                   ((uint32_t)0x00000001U)         /* !< Free run control */
#define QSPI_PDBGCTL_FREE_STOP                   ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define QSPI_PDBGCTL_FREE_RUN                    ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* QSPI_PDBGCTL[SOFT] Bits */
#define QSPI_PDBGCTL_SOFT_OFS                    (1)                             /* !< SOFT Offset */
#define QSPI_PDBGCTL_SOFT_MASK                   ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define QSPI_PDBGCTL_SOFT_IMMEDIATE              ((uint32_t)0x00000000U)         /* !< The peripheral will halt
                                                                                    immediately, even if the resultant
                                                                                    state will result in corruption if
                                                                                    the system is restarted */
#define QSPI_PDBGCTL_SOFT_DELAYED                ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

