TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_qspi.h
/* QSPI_CTL1 Bits */
/* QSPI_CTL1[LBM] Bits */
#define QSPI_CTL1_LBM_OFS                        (1)                             /* !< LBM Offset */
#define QSPI_CTL1_LBM_MASK                       ((uint32_t)0x00000002U)         /* !< Loop back mode */
#define QSPI_CTL1_LBM_DISABLE                    ((uint32_t)0x00000000U)         /* !< Disable loopback mode */
#define QSPI_CTL1_LBM_ENABLE                     ((uint32_t)0x00000002U)         /* !< Enable loopback mode */
/* QSPI_CTL1[CP] Bits */
#define QSPI_CTL1_CP_OFS                         (2)                             /* !< CP Offset */
#define QSPI_CTL1_CP_MASK                        ((uint32_t)0x00000004U)         /* !< Controller or peripheral mode
                                                                                    select. This bit can be modified only
                                                                                    when SPI is disabled, CTL1.ENABLE=0. */
#define QSPI_CTL1_CP_DISABLE                     ((uint32_t)0x00000000U)         /* !< Select Peripheral mode */
#define QSPI_CTL1_CP_ENABLE                      ((uint32_t)0x00000004U)         /* !< Select Controller Mode */
/* QSPI_CTL1[POD] Bits */
#define QSPI_CTL1_POD_OFS                        (3)                             /* !< POD Offset */
#define QSPI_CTL1_POD_MASK                       ((uint32_t)0x00000008U)         /* !< Peripheral-mode: Data output
                                                                                    disabled This bit is relevant only in
                                                                                    Peripheral mode. In
                                                                                    multiple-peripheral system
                                                                                    topologies, SPI controller can
                                                                                    broadcast a message to all
                                                                                    peripherals, while only one
                                                                                    peripheral drives the line.  POD can
                                                                                    be used by the SPI peripheral to
                                                                                    disable driving data on the line. */
#define QSPI_CTL1_POD_DISABLE                    ((uint32_t)0x00000000U)         /* !< SPI can drive the MISO output in
                                                                                    peripheral mode. */
#define QSPI_CTL1_POD_ENABLE                     ((uint32_t)0x00000008U)         /* !< SPI cannot drive the MISO output in
                                                                                    peripheral mode. */
/* QSPI_CTL1[MSB] Bits */
#define QSPI_CTL1_MSB_OFS                        (4)                             /* !< MSB Offset */
#define QSPI_CTL1_MSB_MASK                       ((uint32_t)0x00000010U)         /* !< MSB first select. Controls the
                                                                                    direction of the receive and transmit
                                                                                    shift register. */
#define QSPI_CTL1_MSB_DISABLE                    ((uint32_t)0x00000000U)         /* !< LSB first */
#define QSPI_CTL1_MSB_ENABLE                     ((uint32_t)0x00000010U)         /* !< MSB first */
/* QSPI_CTL1[PREN] Bits */
#define QSPI_CTL1_PREN_OFS                       (5)                             /* !< PREN Offset */
#define QSPI_CTL1_PREN_MASK                      ((uint32_t)0x00000020U)         /* !< Parity receive enable If enabled,
                                                                                    parity reception check will be done
                                                                                    for both controller and peripheral
                                                                                    modes In case of a parity miss-match
                                                                                    the parity error flag RIS.PER will be
                                                                                    set. */
#define QSPI_CTL1_PREN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Disable Parity receive function */
#define QSPI_CTL1_PREN_ENABLE                    ((uint32_t)0x00000020U)         /* !< Enable Parity receive function */
/* QSPI_CTL1[REPEATTX] Bits */
#define QSPI_CTL1_REPEATTX_OFS                   (16)                            /* !< REPEATTX Offset */
#define QSPI_CTL1_REPEATTX_MASK                  ((uint32_t)0x00FF0000U)         /* !< Counter to repeat last transfer 0:
                                                                                    repeat last transfer is disabled. x:
                                                                                    repeat the last transfer with the
                                                                                    given number. The transfer will be
                                                                                    started with writing a data into the
                                                                                    TX Buffer. Sending the data will be
                                                                                    repeated with the given value, so the
                                                                                    data will be transferred X+1 times in
                                                                                    total. The behavior is identical as
                                                                                    if the data would be written into the
                                                                                    TX Buffer that many times as defined
                                                                                    by the value here. It can be used to
                                                                                    clean a transfer or to pull a certain
                                                                                    amount of data by a peripheral. */
#define QSPI_CTL1_REPEATTX_DISABLE               ((uint32_t)0x00000000U)         /* !< REPEATTX disable */
#define QSPI_CTL1_REPEATTX_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_CTL1_REPEATTX_MAXIMUM               ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* QSPI_CTL1[PES] Bits */
#define QSPI_CTL1_PES_OFS                        (6)                             /* !< PES Offset */
#define QSPI_CTL1_PES_MASK                       ((uint32_t)0x00000040U)         /* !< Even Parity Select */
#define QSPI_CTL1_PES_DISABLE                    ((uint32_t)0x00000000U)         /* !< Odd Parity mode */
#define QSPI_CTL1_PES_ENABLE                     ((uint32_t)0x00000040U)         /* !< Even Parity mode */
/* QSPI_CTL1[CDMODE] Bits */
#define QSPI_CTL1_CDMODE_OFS                     (12)                            /* !< CDMODE Offset */
#define QSPI_CTL1_CDMODE_MASK                    ((uint32_t)0x0000F000U)         /* !< Command/Data Mode Value  When
                                                                                    CTL1.CDENABLE is 1, CS3 line is used
                                                                                    as C/D signal to distinguish between
                                                                                    Command (C/D low) and Data (C/D high)
                                                                                    information.  When a value is written
                                                                                    into the CTL1.CDMODE bits, the C/D
                                                                                    (CS3) line will go low for the given
                                                                                    numbers of byte which are sent by the
                                                                                    SPI, starting with the next value to
                                                                                    be transmitted after which, C/D line
                                                                                    will go high automatically  0: Manual
                                                                                    mode with C/D signal as High 1-14:
                                                                                    C/D is low while this number of bytes
                                                                                    are being sent after which, this
                                                                                    field sets to 0 and C/D goes high.
                                                                                    Reading this field at any time
                                                                                    returns the remaining number of
                                                                                    command bytes. 15: Manual mode with
                                                                                    C/D signal as Low. */
#define QSPI_CTL1_CDMODE_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_CTL1_CDMODE_DATA                    ((uint32_t)0x00000000U)         /* !< Manual mode: Data */
#define QSPI_CTL1_CDMODE_MAXIMUM                 ((uint32_t)0x0000F000U)         /* !< Highest possible value */
#define QSPI_CTL1_CDMODE_COMMAND                 ((uint32_t)0x0000F000U)         /* !< Manual mode: Command */
/* QSPI_CTL1[ENABLE] Bits */
#define QSPI_CTL1_ENABLE_OFS                     (0)                             /* !< ENABLE Offset */
#define QSPI_CTL1_ENABLE_MASK                    ((uint32_t)0x00000001U)         /* !< SPI enable */
#define QSPI_CTL1_ENABLE_DISABLE                 ((uint32_t)0x00000000U)         /* !< Disable module function */
#define QSPI_CTL1_ENABLE_ENABLE                  ((uint32_t)0x00000001U)         /* !< Enable module function */
/* QSPI_CTL1[RXTIMEOUT] Bits */
#define QSPI_CTL1_RXTIMEOUT_OFS                  (24)                            /* !< RXTIMEOUT Offset */
#define QSPI_CTL1_RXTIMEOUT_MASK                 ((uint32_t)0x3F000000U)         /* !< Receive Timeout (only for
                                                                                    Peripheral mode) Defines the number
                                                                                    of Clock Cycles before after which
                                                                                    the Receive Timeout flag RTOUT is
                                                                                    set. The time is calculated using the
                                                                                    control register for the clock
                                                                                    selection and divider in the
                                                                                    Controller mode configuration. A
                                                                                    value of 0 disables this function. */
#define QSPI_CTL1_RXTIMEOUT_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_CTL1_RXTIMEOUT_MAXIMUM              ((uint32_t)0x3F000000U)         /* !< Highest possible value */
/* QSPI_CTL1[CDENABLE] Bits */
#define QSPI_CTL1_CDENABLE_OFS                   (11)                            /* !< CDENABLE Offset */
#define QSPI_CTL1_CDENABLE_MASK                  ((uint32_t)0x00000800U)         /* !< Command/Data Mode enable */
#define QSPI_CTL1_CDENABLE_DISABLE               ((uint32_t)0x00000000U)         /* !< CS3 is used for Chip Select */
#define QSPI_CTL1_CDENABLE_ENABLE                ((uint32_t)0x00000800U)         /* !< CS3 is used as CD signal */
/* QSPI_CTL1[PTEN] Bits */
#define QSPI_CTL1_PTEN_OFS                       (8)                             /* !< PTEN Offset */
#define QSPI_CTL1_PTEN_MASK                      ((uint32_t)0x00000100U)         /* !< Parity transmit enable If enabled,
                                                                                    parity transmission will be done for
                                                                                    both controller and peripheral modes. */
#define QSPI_CTL1_PTEN_DISABLE                   ((uint32_t)0x00000000U)         /* !< Parity transmission is disabled */
#define QSPI_CTL1_PTEN_ENABLE                    ((uint32_t)0x00000100U)         /* !< Parity transmission is enabled */

/* QSPI_CLKCTL Bits */
/* QSPI_CLKCTL[SCR] Bits */
#define QSPI_CLKCTL_SCR_OFS                      (0)                             /* !< SCR Offset */
#define QSPI_CLKCTL_SCR_MASK                     ((uint32_t)0x000003FFU)         /* !< Serial clock divider: This is used
                                                                                    to generate the transmit and receive
                                                                                    bit rate of the SPI. The SPI bit rate
                                                                                    is (SPI's functional clock
                                                                                    frequency)/((SCR+1)*2). SCR is a
                                                                                    value from 0-1023. */
#define QSPI_CLKCTL_SCR_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_CLKCTL_SCR_MAXIMUM                  ((uint32_t)0x000003FFU)         /* !< Highest possible value */
/* QSPI_CLKCTL[DSAMPLE] Bits */
#define QSPI_CLKCTL_DSAMPLE_OFS                  (28)                            /* !< DSAMPLE Offset */
#define QSPI_CLKCTL_DSAMPLE_MASK                 ((uint32_t)0xF0000000U)         /* !< Delayed sampling value.  In
                                                                                    controller mode the data on the input
                                                                                    pin will be delayed sampled by the
                                                                                    defined clock cycles of internal
                                                                                    functional clock hence relaxing the
                                                                                    setup time of input data. This
                                                                                    setting is useful in systems where
                                                                                    the board delays and external
                                                                                    peripheral delays are more than the
                                                                                    input setup time of the controller.
                                                                                    Please refer to the datasheet for
                                                                                    values of controller input setup time
                                                                                    and assess what DSAMPLE value meets
                                                                                    the requirement of the system. Note:
                                                                                    High values of DSAMPLE can cause HOLD
                                                                                    time violations and must be factored
                                                                                    in the calculations. */
#define QSPI_CLKCTL_DSAMPLE_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_CLKCTL_DSAMPLE_MAXIMUM              ((uint32_t)0xF0000000U)         /* !< Highest possible value */

