TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_qspi.h
/* QSPI_IFLS Bits */
/* QSPI_IFLS[TXIFLSEL] Bits */
#define QSPI_IFLS_TXIFLSEL_OFS                   (0)                             /* !< TXIFLSEL Offset */
#define QSPI_IFLS_TXIFLSEL_MASK                  ((uint32_t)0x00000007U)         /* !< SPI Transmit Interrupt FIFO Level
                                                                                    Select  The trigger points for the
                                                                                    transmit interrupt are as follows: */
#define QSPI_IFLS_TXIFLSEL_LVL_OFF               ((uint32_t)0x00000000U)         /* !< Reserved */
#define QSPI_IFLS_TXIFLSEL_LVL_3_4               ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define QSPI_IFLS_TXIFLSEL_LVL_1_2               ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define QSPI_IFLS_TXIFLSEL_LVL_1_4               ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define QSPI_IFLS_TXIFLSEL_LVL_RES4              ((uint32_t)0x00000004U)         /* !< Reserved */
#define QSPI_IFLS_TXIFLSEL_LVL_EMPTY             ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define QSPI_IFLS_TXIFLSEL_LVL_RES6              ((uint32_t)0x00000006U)         /* !< Reserved */
#define QSPI_IFLS_TXIFLSEL_LEVEL_1               ((uint32_t)0x00000007U)         /* !< Trigger when TX FIFO has >= 1 frame
                                                                                    free Should be used with DMA */
/* QSPI_IFLS[RXIFLSEL] Bits */
#define QSPI_IFLS_RXIFLSEL_OFS                   (3)                             /* !< RXIFLSEL Offset */
#define QSPI_IFLS_RXIFLSEL_MASK                  ((uint32_t)0x00000038U)         /* !< SPI Receive Interrupt FIFO Level
                                                                                    Select  The trigger points for the
                                                                                    receive interrupt are as follows: */
#define QSPI_IFLS_RXIFLSEL_LVL_OFF               ((uint32_t)0x00000000U)         /* !< Reserved */
#define QSPI_IFLS_RXIFLSEL_LVL_1_4               ((uint32_t)0x00000008U)         /* !< RX FIFO >= 1/4 full */
#define QSPI_IFLS_RXIFLSEL_LVL_1_2               ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/2 full (default) */
#define QSPI_IFLS_RXIFLSEL_LVL_3_4               ((uint32_t)0x00000018U)         /* !< RX FIFO >= 3/4 full */
#define QSPI_IFLS_RXIFLSEL_LVL_RES4              ((uint32_t)0x00000020U)         /* !< Reserved */
#define QSPI_IFLS_RXIFLSEL_LVL_FULL              ((uint32_t)0x00000028U)         /* !< RX FIFO is full */
#define QSPI_IFLS_RXIFLSEL_LVL_RES6              ((uint32_t)0x00000030U)         /* !< Reserved */
#define QSPI_IFLS_RXIFLSEL_LEVEL_1               ((uint32_t)0x00000038U)         /* !< Trigger when RX FIFO contains >= 1
                                                                                    frame */

/* QSPI_STAT Bits */
/* QSPI_STAT[TFE] Bits */
#define QSPI_STAT_TFE_OFS                        (0)                             /* !< TFE Offset */
#define QSPI_STAT_TFE_MASK                       ((uint32_t)0x00000001U)         /* !< Transmit FIFO empty. */
#define QSPI_STAT_TFE_NOT_EMPTY                  ((uint32_t)0x00000000U)         /* !< Transmit FIFO is not empty. */
#define QSPI_STAT_TFE_EMPTY                      ((uint32_t)0x00000001U)         /* !< Transmit FIFO is empty. */
/* QSPI_STAT[TNF] Bits */
#define QSPI_STAT_TNF_OFS                        (1)                             /* !< TNF Offset */
#define QSPI_STAT_TNF_MASK                       ((uint32_t)0x00000002U)         /* !< Transmit FIFO not full */
#define QSPI_STAT_TNF_FULL                       ((uint32_t)0x00000000U)         /* !< Transmit FIFO is full. */
#define QSPI_STAT_TNF_NOT_FULL                   ((uint32_t)0x00000002U)         /* !< Transmit FIFO is not full. */
/* QSPI_STAT[RFE] Bits */
#define QSPI_STAT_RFE_OFS                        (2)                             /* !< RFE Offset */
#define QSPI_STAT_RFE_MASK                       ((uint32_t)0x00000004U)         /* !< Receive FIFO empty. */
#define QSPI_STAT_RFE_NOT_EMPTY                  ((uint32_t)0x00000000U)         /* !< Receive FIFO is not empty. */
#define QSPI_STAT_RFE_EMPTY                      ((uint32_t)0x00000004U)         /* !< Receive FIFO is empty. */
/* QSPI_STAT[RNF] Bits */
#define QSPI_STAT_RNF_OFS                        (3)                             /* !< RNF Offset */
#define QSPI_STAT_RNF_MASK                       ((uint32_t)0x00000008U)         /* !< Receive FIFO not full */
#define QSPI_STAT_RNF_FULL                       ((uint32_t)0x00000000U)         /* !< Receive FIFO is full. */
#define QSPI_STAT_RNF_NOT_FULL                   ((uint32_t)0x00000008U)         /* !< Receive FIFO is not full. */
/* QSPI_STAT[BUSY] Bits */
#define QSPI_STAT_BUSY_OFS                       (4)                             /* !< BUSY Offset */
#define QSPI_STAT_BUSY_MASK                      ((uint32_t)0x00000010U)         /* !< Busy */
#define QSPI_STAT_BUSY_IDLE                      ((uint32_t)0x00000000U)         /* !< SPI is in idle mode. */
#define QSPI_STAT_BUSY_ACTIVE                    ((uint32_t)0x00000010U)         /* !< SPI is currently transmitting
                                                                                    and/or receiving data, or transmit
                                                                                    FIFO is not empty. */

/* QSPI_RXDATA Bits */
/* QSPI_RXDATA[DATA] Bits */
#define QSPI_RXDATA_DATA_OFS                     (0)                             /* !< DATA Offset */
#define QSPI_RXDATA_DATA_MASK                    ((uint32_t)0x0000FFFFU)         /* !< Received Data When PACKEN=1,two
                                                                                    entries of the FIFO are returned as a
                                                                                    32-bit value. When PACKEN=0, 1 entry
                                                                                    of FIFO is returned as 16-bit value.
                                                                                    As data values are removed by the
                                                                                    receive logic from the incoming data
                                                                                    frame, they are placed into the entry
                                                                                    in the receive FIFO, pointed to by
                                                                                    the current FIFO write pointer.
                                                                                    Received data less than 16 bits is
                                                                                    automatically right justified in the
                                                                                    receive buffer. */
#define QSPI_RXDATA_DATA_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_RXDATA_DATA_MAXIMUM                 ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* QSPI_TXDATA Bits */
/* QSPI_TXDATA[DATA] Bits */
#define QSPI_TXDATA_DATA_OFS                     (0)                             /* !< DATA Offset */
#define QSPI_TXDATA_DATA_MASK                    ((uint32_t)0x0000FFFFU)         /* !< Transmit Data  When read, last
                                                                                    written value will be returned. If
                                                                                    the last write to this field was a
                                                                                    32-bit write (with PACKEN=1), 32-bits
                                                                                    will be returned and if the last
                                                                                    write was a 16-bit write (PACKEN=0),
                                                                                    those 16-bits will be returned.
                                                                                    When written, one or two FIFO entries
                                                                                    will be written depending on PACKEN
                                                                                    value. Data values are removed from
                                                                                    the transmit FIFO one value at a time
                                                                                    by the transmit logic. It is loaded
                                                                                    into the transmit serial shifter,
                                                                                    then serially shifted out onto the
                                                                                    TXD output pin at the programmed bit
                                                                                    rate.   When a data size of less than
                                                                                    16 bits is selected, the user must
                                                                                    right-justify data written to the
                                                                                    transmit FIFO. The transmit logic
                                                                                    ignores the unused bits. */
#define QSPI_TXDATA_DATA_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define QSPI_TXDATA_DATA_MAXIMUM                 ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_qspi__include */

